charliermarsh.ruff
docker.docker
github.copilot-chat
golang.go
gruntfuggly.todo-tree
hashicorp.terraform
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
njpwerner.autodocstring
pkief.material-icon-theme
redhat.ansible
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
vscodevim.vim
waderyan.gitblame
zhuangtongfa.material-theme
